x-Roy-x/Psoc/Lab5.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "SW_1.h"
#include "SW_1_aliases.h"
#include "Timer.h"
#include "Clock_1.h"
#include "Timer_Int.h"
#include "SW_Int_1.h"
#include "LCD.h"
#include "QuadDec.h"
#include "phiA.h"
#include "phiA_aliases.h"
#include "phiB.h"
#include "phiB_aliases.h"
#include "Clock_2.h"
#include "QuadDec_Int.h"
#include "SW_Int_2.h"
#include "SW_2.h"
#include "SW_2_aliases.h"
#include "SW_3.h"
#include "SW_3_aliases.h"
#include "SW_Int_3.h"
#include "SW_4.h"
#include "SW_4_aliases.h"
#include "SW_Int_4.h"
#include "Clock_3.h"
#include "Clock_4.h"
#include "Clock_5.h"
#include "Clock_6.h"
#include "Pin_1.h"
#include "Pin_1_aliases.h"
#include "Pin_2.h"
#include "Pin_2_aliases.h"
#include "Pin_3.h"
#include "Pin_3_aliases.h"
#include "Pin_4.h"
#include "Pin_4_aliases.h"
#include "PWM.h"
#include "Clock_7.h"
#include "Rotor.h"
#include "LCD_LCDPort.h"
#include "LCD_LCDPort_aliases.h"
#include "cy_em_eeprom.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"

/*[]*/

